Revit 2017 API
LightNode Class
 This is a class representing a Light element in a model-exporting process.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2014
Syntax
C#
public class LightNode : ContentNode
Visual Basic
Public Class LightNode _
	Inherits ContentNode
Visual C++
public ref class LightNode : public ContentNode
Remarks
 See also: OnLight(LightNode).
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.ContentNode
 Autodesk.Revit.DB.LightNode
See Also
LightNode Members
Autodesk.Revit.DB Namespace